CSI API ETABS v1
cPropMaterial.GetMassSource Method
 DEPRECATED Retrieves the mass source for the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMassSource(
	ref int MyOption,
	ref int NumberLoads,
	ref string[] LoadPat,
	ref double[] SF
)
Function GetMassSource (
	ByRef MyOption As Integer,
	ByRef NumberLoads As Integer,
	ByRef LoadPat As String(),
	ByRef SF As Double()
) As Integer
Dim instance As cPropMaterial
Dim MyOption As Integer
Dim NumberLoads As Integer
Dim LoadPat As String()
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.GetMassSource(MyOption,
	NumberLoads, LoadPat, SF)
int GetMassSource(
	int% MyOption,
	int% NumberLoads,
	array<String^>^% LoadPat,
	array<double>^% SF
)
abstract GetMassSource :
        MyOption : int byref *
        NumberLoads : int byref *
        LoadPat : string[] byref *
        SF : float[] byref -> int
Parameters
MyOption
Type: System.Int32
This is 1, 2 or 3, indicating the mass source option.
Value | Option
1 | From element self mass and additional masses
2 | From loads
3 | From element self mass and additional masses and loads
NumberLoads
Type: System.Int32
The number of load patterns from which mass is obtained. This item applies only when MyOption is 2 or 3.
LoadPat
Type: System.String[]
This is an array of the names of the load patterns from which mass is obtained. This item applies only when MyOption is 2 or 3.
SF
Type: System.Double[]
This is an array of load patterns multipliers used to calculate the mass. This item applies only when MyOption is 2 or 3
Return Value
Type: Int32
Returns zero if the mass source is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 This function is DEPRECATED. Please use GetMassSource_1(Boolean, Boolean, Boolean, Int32, String[], Double[])
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyLoadPat() As String
       Dim MySF() As Double
       Dim MyOption As Integer
       Dim NumberLoads As Integer
       Dim LoadPat() As String
       Dim sf() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set mass source
       ReDim MyLoadPat(1)
       ReDim MySF(1)
       MyLoadPat(0) = "DEAD"
       MyLoadPat(1) = "LIVE"
       MySF(0) = 1
       MySF(1) = 0.2
       ret = SapModel.PropMaterial.SetMassSource(3, 2, MyLoadPat, MySF)
   'get mass source
       ret = SapModel.PropMaterial.GetMassSource(MyOption, NumberLoads, LoadPat, sf)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace